#######################################
# 6.3.2 input 함수의 결과를 변수에 할당하기 ##
################################################################################
# 변수 = input()
#
# >>> x = input()
# Hello, world! (입력)
# >>> x
# 'Hello, world!'
################################################################################


##############################
# 6.3.4 입력 값을 정수로 변환하기 ##
#################################################################################
# 10 + 20의 결과가 30이 나오게 하려면 input에서 입력받은 문자열을 숫자(정수)로 만들어주어야 합니다.
# 변수 = int(input())
# 변수 = int(input('문자열'))
#
# a = int(input('첫 번째 숫자를 입력하세요: '))  # int를 사용하여 입력 값을 정수로 변환
# b = int(input('두 번째 숫자를 입력하세요: '))  # int를 사용하여 입력 값을 정수로 변환
#
# print(a + b)
################################################################################


#################################
# 6.4 입력 값을 변수 두 개에 저장하기 ##
# split(기준문자열) : 기준 문자열을 기준으로 리스트 생성
################################################################################
# 지금까지 input 한 번에 값 하나만 입력받았습니다.
# 그럼 input 한 번에 값을 여러 개 입력받으려면 어떻게 해야 할까요?
# 이때는 input에서 split을 사용한 변수 여러 개에 저장해주면 됩니다(각 변수는 콤마로 구분해줍니다).
#
# 변수1, 변수2 = input().split()
# 변수1, 변수2 = input().split('기준문자열')
# 변수1, 변수2 = input('문자열').split()
# 변수1, 변수2 = input('문자열').split('기준문자열')
#
# a, b = input('문자열 두 개를 입력하세요: ').split()  # 입력받은 값을 공백을 기준으로 분리
# a = int(a)    # 변수를 정수로 변환한 뒤 다시 저장
# b = int(b)    # 변수를 정수로 변환한 뒤 다시 저장
# print(a + b)
#
# 숫자 두 개를 입력하세요: 10 20 (입력)
# 30
################################################################################


##################################
# 6.4.3 map을 사용하여 정수로 변환하기 ##
################################################################################
# split의 결과를 매번 int로 변환해주려니 귀찮습니다.
# 이때는 map을 함께 사용하면 됩니다.
# map에 int와 input().split()을 넣으면 split의 결과를 모두 int로 변환해줍니다
# (실수로 변환할 때는 int 대신 float를 넣습니다.).
#
# a, b = map(int, input('숫자 두 개를 입력하세요: ').split())
# print(a + b)
#
# a = list(map(int, input('숫자입력(구분 : , )').split(','))
################################################################################


####################################################
# 6.4.4 split 이용하여 입력받은 값을 콤마를 기준으로 분리하기 ##
################################################################################
# a, b = map(int, input('숫자 두 개를 입력하세요: ').split(','))  # 입력받은 값을 콤마를 기준으로 분리
# print(a + b)
#
# 숫자 두 개를 입력하세요: 10,20 (입력)
# 30
################################################################################

a = int(input())
b = tuple(range(-10, 10, a))
print(b)
